from flask import Flask, jsonify, render_template, request
from flask_moment import Moment
import json
import time
from datetime import datetime

#strftime("%Y-%m-%d %H:%M:%S", gmtime())

data = datetime.now().strftime('%d.%m.%Y %H:%M:%S')
list_exchange_rate = [
	'Доллар',
	'Евро',
	'Рубль',
	'Юань',
	'Австралийский доллар',
	'Белоруcский рубль',
	'Франк',
	'Фунт стерлинга',
	'Рупия',
	'Тенге'
]

list_measurements = [
	'килограмм',
	'фунты',
	'метр',
	'футы',
	'километр',
	'мили'
]

all_dict_measurements = {
	'килограмм': {'фунты': 2.2},
	'фунты': {'килограмм': 0.45},
	'метр': {'футы': 3.28},
	'футы': {'метр': 0.3},
	'километр': {'мили': 0.62},
	'мили': {'километр': 1.61},
}

rubel = {
	'Доллар': 93,
	'Евро': 100,
	'Юань': 12.85,
	'Австралийский доллар': 61.85,
	'Белорусский рубль': 28.36,
	'Франк': 0.83,
	'Фунт': 117.77,
	'Рупия': 1.12,
	'Тенге': 0.12
}

dollar = {
	'Евро': 1.1, 
	'Рубль': 0.01, 
	'Юань': 0.14, 
	'Австралийский доллар': 0.66, 
	'Белоруcский рубль': 0.31, 
	'Франк': 0.009, 
	'Фунт стерлинга': 1.3, 
	'Рупия': 0.012, 
	'Тенге': 0.022
}

evro = {
	'Доллар': 0.92, 
	'Рубль': 0.001, 
	'Юань': 0.13, 
	'Австралийский доллар': 0.61, 
	'Белоруcский рубль': 0.28, 
	'Франк': 0.008, 
	'Фунт стерлинга': 1.17, 
	'Рупия': 0.011, 
	'Тенге': 0.002
}

Uan = {
	'Доллар': 7.23, 
	'Евро': 7.85, 
	'Рубль': 0.08, 
	'Австралийский доллар': 4.79, 
	'Белоруcский рубль': 2.21, 
	'Франк': 0.064, 
	'Фунт стерлинга': 9.16, 
	'Рупия': 0.00046, 
	'Тенге': 0.016
}

au_dollar = {
	'Доллар': 1.51,
	'Евро': 1.64,
	'Рубль': 0.016,
	'Юань': 0.21,
	'Белоруcский рубль': 0.46,
	'Франк': 0.013,
	'Фунт стерлинга': 1.91,
	'Рупия': 0.018,
	'Тенге': 0.0034
}

bel = {
	'Доллар': 3.28,
	'Евро': 3.56,
	'Рубль': 0.035,
	'Юань': 0.45,
	'Австралийский доллар': 2.17,
	'Франк': 0.029,
	'Фунт стерлинга': 4.15,
	'Рупия': 0.00021,
	'Тенге': 0.0073
}

frank = {
	'Доллар': 112.38,
	'Евро': 122,
	'Рубль': 1.21,
	'Юань': 15.54,
	'Австралийский доллар': 74.4,
	'Белоруcский рубль': 34.3,
	'Фунт стерлинга': 142.46,
	'Рупия': 0.0071,
	'Тенге': 0.25
}

funt = {
	'Доллар': 0.79,
	'Евро': 0.86,
	'Рубль': 0.0085,
	'Юань': 0.11,
	'Австралийский доллар': 0.52,
	'Белоруcский рубль': 0.24,
	'Франк': 0.007,
	'Рупия': 0.00005,
	'Тенге': 0.0018
}

rup = {
	'Доллар': 15850,
	'Евро': 17201.85,
	'Рубль': 170.6,
	'Юань': 2192,
	'Австралийский доллар': 10496.6,
	'Белоруcский рубль': 4838.11,
	'Франк': 141,
	'Фунт стерлинга': 20094.6,
	'Тенге': 35.44
}

tenge = {
	'Доллар': 447.2,
	'Евро': 485.4,
	'Рубль': 4.8,
	'Юань': 61.9,
	'Австралийский доллар': 296.22,
	'Белоруcский рубль': 136.5,
	'Франк': 4,
	'Фунт стерлинга': 567,
	'Рупия': 0.028
}

all_exachange_rate = {
	'Доллар': dollar,
	'Евро': evro,
	'Рубль': rubel,
	'Юань': Uan,
	'Австралийский доллар': au_dollar,
	'Белоруcский рубль': bel,
	'Франк': frank,
	'Фунт стерлинга': funt,
	'Рупия': rup,
	'Тенге': tenge
}